out/logs_post/ab_posts1000_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=posts10001&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   5.135 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156504 bytes
HTML transferred:       21500 bytes
Requests per second:    97.38 [#/sec] (mean)
Time per request:       513.460 [ms] (mean)
Time per request:       10.269 [ms] (mean, across all concurrent requests)
Transfer rate:          29.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       86  203  74.7    197     501
Processing:    90  249  82.5    238     601
Waiting:       90  248  82.4    237     601
Total:        217  452 122.1    426     942

Percentage of the requests served within a certain time (ms)
  50%    426
  66%    466
  75%    488
  80%    511
  90%    632
  95%    689
  98%    851
  99%    852
 100%    942 (longest request)