out/logs_post/ab_posts100_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=posts1001&limit=20
Document Length:        42 bytes

Concurrency Level:      50
Time taken for tests:   6.461 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156004 bytes
HTML transferred:       21000 bytes
Requests per second:    77.39 [#/sec] (mean)
Time per request:       646.113 [ms] (mean)
Time per request:       12.922 [ms] (mean, across all concurrent requests)
Transfer rate:          23.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       44   68  26.5     59     285
Processing:    45  249 136.4    255    3058
Waiting:       45  249 136.2    254    3054
Total:         95  317 137.0    316    3137

Percentage of the requests served within a certain time (ms)
  50%    316
  66%    330
  75%    340
  80%    344
  90%    360
  95%    381
  98%    418
  99%    463
 100%   3137 (longest request)