out/logs_post/ab_posts10_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=posts101&limit=20
Document Length:        41 bytes

Concurrency Level:      50
Time taken for tests:   6.105 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      155504 bytes
HTML transferred:       20500 bytes
Requests per second:    81.90 [#/sec] (mean)
Time per request:       610.529 [ms] (mean)
Time per request:       12.211 [ms] (mean, across all concurrent requests)
Transfer rate:          24.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       48   94  40.4     79     234
Processing:    47  316 308.9    194    1716
Waiting:       45  315 308.7    192    1710
Total:        115  409 311.9    281    1841

Percentage of the requests served within a certain time (ms)
  50%    281
  66%    367
  75%    426
  80%    485
  90%    902
  95%   1088
  98%   1587
  99%   1725
 100%   1841 (longest request)