out/logs_post/ab_posts10_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=posts101&limit=20
Document Length:        41 bytes

Concurrency Level:      50
Time taken for tests:   2.760 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      155500 bytes
HTML transferred:       20500 bytes
Requests per second:    181.17 [#/sec] (mean)
Time per request:       275.983 [ms] (mean)
Time per request:       5.520 [ms] (mean, across all concurrent requests)
Transfer rate:          55.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       47   84  22.8     82     171
Processing:    49  157  73.2    134     409
Waiting:       45  156  73.2    133     409
Total:        120  241  73.7    213     537

Percentage of the requests served within a certain time (ms)
  50%    213
  66%    239
  75%    292
  80%    327
  90%    357
  95%    376
  98%    404
  99%    443
 100%    537 (longest request)