out/logs_post/ab_posts10_run3.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=posts101&limit=20
Document Length:        41 bytes

Concurrency Level:      50
Time taken for tests:   2.855 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      155504 bytes
HTML transferred:       20500 bytes
Requests per second:    175.12 [#/sec] (mean)
Time per request:       285.516 [ms] (mean)
Time per request:       5.710 [ms] (mean, across all concurrent requests)
Transfer rate:          53.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       50   84  26.8     77     258
Processing:    47  160  53.9    160     428
Waiting:       47  158  53.0    158     428
Total:        111  243  52.0    231     506

Percentage of the requests served within a certain time (ms)
  50%    231
  66%    245
  75%    265
  80%    288
  90%    320
  95%    338
  98%    365
  99%    429
 100%    506 (longest request)